
//  Удаляем символ из начала и конца строки (Аналог trim(string, char) в PHP)
//  предварительно требуется заменить пробелы каким-либо редким сочетанием символов, 
//  а после преобразования выполнить обратную замену
//  @ИсходнаяСтрока - строка
//  @Символ - который надо удалить
Функция УдалитьСимволСначалаКонцаСтроки(ИсходнаяСтрока, Символ)
	Возврат СтрЗаменить(СтрЗаменить(СокрЛП(СтрЗаменить(СтрЗаменить(ИсходнаяСтрока, " ", Символы.НПП), Символ, " ")), " ", Символ), Символы.НПП, " ");
КонецФункции
